---
kind: other
id: Methods.T:Autodesk.Revit.UI.IExternalEventHandler
source: html/dc7ccfc6-f7a2-6f52-1a14-1cb5406ebc09.htm
---
# IExternalEventHandler Methods

This method is called to handle the external event.